t21/nRF5x_AT/Walnut-AT/wble.c
    // Prepare wakeup buttons.
    err_code = bsp_btn_ble_sleep_mode_prepare();
    APP_ERROR_CHECK(err_code);

    // Go to system-off mode (this function will not return; wakeup will cause a reset).
    err_code = sd_power_system_off();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for searching a given name in the advertisement packets.
 *
 * @details Use this function to parse received advertising data and to find a given
 * name in them either as 'complete_local_name' or as 'short_local_name'.
 *
 * @param[in]   p_adv_report   advertising data to parse.
 * @param[in]   name_to_find   name to search.
 * @return   true if the given name was found, false otherwise.
 */
static bool find_adv_flags(const ble_gap_evt_adv_report_t *p_adv_report, uint8_t flags)
{
    uint32_t err_code;
    data_t   adv_data;
    data_t   dev_name;

    // Initialize advertisement report for parsing
    adv_data.p_data     = (uint8_t *)p_adv_report->data;
    adv_data.data_len   = p_adv_report->dlen;


    //search for advertising names
    err_code = adv_report_parse(BLE_GAP_AD_TYPE_FLAGS,
                                &adv_data,
                                &dev_name);
    if (err_code == NRF_SUCCESS)
    {
//        if (memcmp(name_to_find, dev_name.p_data, dev_name.data_len )== 0)
        if ((flags & *dev_name.p_data) != 0)
        {
            return true;
        }
    }
//    else
//    {
//        // Look for the short local name if it was not found as complete
//        err_code = adv_report_parse(BLE_GAP_AD_TYPE_SHORT_LOCAL_NAME,
//                                    &adv_data,
//                                    &dev_name);
//        if (err_code != NRF_SUCCESS)
//        {
//            return false;
//        }
//        if (memcmp(m_target_periph_name, dev_name.p_data, dev_name.data_len )== 0)
//        {
//            return true;
//        }
//    }
    return false;
}


static bool find_adv_name(const ble_gap_evt_adv_report_t *p_adv_report, const char * name_to_find)
{
    uint32_t err_code;
    data_t   adv_data;
    data_t   dev_name;

    // Initialize advertisement report for parsing
    adv_data.p_data     = (uint8_t *)p_adv_report->data;
    adv_data.data_len   = p_adv_report->dlen;


    //search for advertising names
    err_code = adv_report_parse(BLE_GAP_AD_TYPE_COMPLETE_LOCAL_NAME,
                                &adv_data,
                                &dev_name);
    if (err_code == NRF_SUCCESS)
    {
        if (memcmp(name_to_find, dev_name.p_data, dev_name.data_len )== 0)
        {
            return true;
        }
    }
    else
    {
        // Look for the short local name if it was not found as complete
        err_code = adv_report_parse(BLE_GAP_AD_TYPE_SHORT_LOCAL_NAME,
                                    &adv_data,
                                    &dev_name);
        if (err_code != NRF_SUCCESS)
        {
            return false;
        }
        if (memcmp(m_target_periph_name, dev_name.p_data, dev_name.data_len )== 0)
        {
            return true;
        }
    }
    return false;
}


/**@brief Function for searching a given addr in the advertisement packets.
 *
 * @details Use this function to parse received advertising data and to find a given
 * addr in them.
 *
 * @param[in]   p_adv_report   advertising data to parse.
 * @param[in]   p_addr   name to search.
 * @return   true if the given name was found, false otherwise.
 */
static bool find_peer_addr(const ble_gap_evt_adv_report_t *p_adv_report, const ble_gap_addr_t * p_addr)
{
    if (p_addr->addr_type == p_adv_report->peer_addr.addr_type)
    {
        if (memcmp(p_addr->addr, p_adv_report->peer_addr.addr, sizeof(p_adv_report->peer_addr.addr)) == 0)
        {
            return true;
        }
    }
    return false;
}


/**@brief Function for searching a UUID in the advertisement packets.
 *
 * @details Use this function to parse received advertising data and to find a given
 * UUID in them.
 *
 * @param[in]   p_adv_report   advertising data to parse.
 * @param[in]   uuid_to_find   UUIID to search.
 * @return   true if the given UUID was found, false otherwise.
 */
static bool find_adv_uuid(const ble_gap_evt_adv_report_t *p_adv_report, const uint16_t uuid_to_find)
{
    uint32_t err_code;
    data_t   adv_data;
    data_t   type_data;

    // Initialize advertisement report for parsing.
    adv_data.p_data     = (uint8_t *)p_adv_report->data;
    adv_data.data_len   = p_adv_report->dlen;

    err_code = adv_report_parse(BLE_GAP_AD_TYPE_16BIT_SERVICE_UUID_MORE_AVAILABLE,
                                &adv_data,
                                &type_data);

    if (err_code != NRF_SUCCESS)
    {
        // Look for the services in 'complete' if it was not found in 'more available'.
        err_code = adv_report_parse(BLE_GAP_AD_TYPE_16BIT_SERVICE_UUID_COMPLETE,
                                    &adv_data,
                                    &type_data);

        if (err_code != NRF_SUCCESS)
        {
            // If we can't parse the data, then exit.
            return false;
        }
    }

    // Verify if any UUID match the given UUID.
    for (uint32_t u_index = 0; u_index < (type_data.data_len / sizeof(uint16_t)); u_index++)
    {
        uint16_t extracted_uuid;

        UUID16_EXTRACT(&extracted_uuid, &type_data.p_data[u_index * sizeof(uint16_t)]);

        if (extracted_uuid == uuid_to_find)
        {
            return true;
        }
    }
    return false;
}


static bool is_first_discovery(ble_gap_evt_adv_report_t adv_report)
{  
    for (int i = 0; i < m_num_devices; i++) {
        if (adv_report.peer_addr.addr[0] == m_found_devices_list[i].addr[0] &&
            adv_report.peer_addr.addr[1] == m_found_devices_list[i].addr[1] &&
            adv_report.peer_addr.addr[2] == m_found_devices_list[i].addr[2] &&
            adv_report.peer_addr.addr[3] == m_found_devices_list[i].addr[3] &&
            adv_report.peer_addr.addr[4] == m_found_devices_list[i].addr[4] &&
            adv_report.peer_addr.addr[5] == m_found_devices_list[i].addr[5])
        {
            if ((adv_report.scan_rsp == 0) && !m_found_devices_list[i].adv_found)
            {
                m_found_devices_list[i].adv_found = true;
                return true;
            }
            if ((adv_report.scan_rsp == 1) && !m_found_devices_list[i].scan_resp_found)
            {
                m_found_devices_list[i].scan_resp_found = true;
                return true;
            }
            return false;
        }
    }
    
    if (m_num_devices < MAX_NUM_DEVICES)
    {
        m_found_devices_list[m_num_devices].addr[0] = adv_report.peer_addr.addr[0];
        m_found_devices_list[m_num_devices].addr[1] = adv_report.peer_addr.addr[1];
        m_found_devices_list[m_num_devices].addr[2] = adv_report.peer_addr.addr[2];
        m_found_devices_list[m_num_devices].addr[3] = adv_report.peer_addr.addr[3];
        m_found_devices_list[m_num_devices].addr[4] = adv_report.peer_addr.addr[4];
        m_found_devices_list[m_num_devices].addr[5] = adv_report.peer_addr.addr[5];
        if (adv_report.scan_rsp == 0)
        {
            m_found_devices_list[m_num_devices].adv_found = true;
        }
        else
        {
            m_found_devices_list[m_num_devices].scan_resp_found = true;
        }
        m_num_devices++;
    }

