t21/nRF5x_AT/Walnut-AT/wble.c
    ret = bsp_indication_set(BSP_INDICATE_SCANNING);
    APP_ERROR_CHECK(ret);
}


/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds)
{
    bsp_event_t startup_event;

    uint32_t err_code = bsp_init(BSP_INIT_LED | BSP_INIT_BUTTONS,
                                 APP_TIMER_TICKS(100, APP_TIMER_PRESCALER),
                                 bsp_event_handler);
    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/* GATT generic Event handler. */
void gatt_evt_handler(nrf_ble_gatt_t * p_gatt, nrf_ble_gatt_evt_t * p_evt)
{
    NRF_LOG_INFO("GATT MTU on link %d changed to %d\r\n",
                 p_evt->conn_handle,
                 p_evt->att_mtu_effective);
    if (m_retry_db_disc)
    {
        ret_code_t err_code;
        NRF_LOG_DEBUG("Retrying DB discovery.\r\n");
        m_retry_db_disc = false;
        // Discover peer's services.
        err_code = ble_db_discovery_start(&m_ble_db_discovery, m_pending_db_disc_conn);
        if (err_code == NRF_ERROR_BUSY)
        {
            NRF_LOG_DEBUG("ble_db_discovery_start() returned busy, will retry later.\r\n");
            m_retry_db_disc = true;
        }
        else
        {
            APP_ERROR_CHECK(err_code);
        }
    }
}


/* GATT Module init. */
void gatt_init(void)
{
    ret_code_t err_code = nrf_ble_gatt_init(&m_gatt, gatt_evt_handler);
    APP_ERROR_CHECK(err_code);
}


int wble_init(void)
{
    bool erase_bonds;

    // Initialize.
    buttons_leds_init(&erase_bonds);
    ble_stack_init();
    peer_manager_init(erase_bonds);
    if (erase_bonds == true)
    {
        NRF_LOG_INFO("Bonds erased!\r\n");
    }
    gatt_init();
    db_discovery_init();
//    hrs_c_init();
    bas_c_init();

    // Start scanning for peripherals and initiate connection
    // with devices that advertise Heart Rate UUID.
    //NRF_LOG_INFO("Heart rate collector example.\r\n");

    /* Setting scan parameters to default values */
    m_scan_param.active   = 0;
    m_scan_param.interval = SCAN_INTERVAL;
    m_scan_param.window   = SCAN_WINDOW;
    
    //scan_start();
}


bool wble_get_cfg(uint8_t param_tag, uint8_t *resp_str, uint8_t *resp_str_len)
{
    uint32_t resp;
// TODO: Add more options to read from    
    switch (param_tag) {
        case 9:
            resp = m_scan_param.interval;
            break;
            
        case 10:
            resp = m_scan_param.window;
            break;
            
        default:
            return false;
    }
        
    *resp_str_len = sprintf(resp_str, "+UBTLECFG:%d,%d\r\n", param_tag, resp);
    
    if (*resp_str_len < 0) {
        return false;
    }
    
    return true;
}


bool wble_set_cfg(uint8_t param_tag, uint8_t param_value)
{
    // TODO: Add more options to switch
    switch (param_tag) {
        case 9:
            if ((param_value >= 16) && (param_value <= 16384) && (param_value >= m_scan_param.window)) {
                m_scan_param.interval = param_value;
            } else {
                return false;
            }
            break;
            
        case 10:
            if ((param_value >= 16) && (param_value <= 16384) && (param_value <= m_scan_param.interval)) {
                m_scan_param.window = param_value;
            } else {
                return false;
            }
            break;
            
        default:
            return false;
    }
}


bool wble_scan_timeout_set(uint16_t timeout)
{
    m_scan_param.timeout = timeout;
    
    return true;
}


bool wble_scan_start(uint8_t discovery_type, wble_scan_mode_t mode, uint16_t discovery_length, wble_evt_handler_t evt_handler)
{
    if (discovery_type > 4) {
        return false;
    }
    
    m_discovery_type = discovery_type;
    p_callback = evt_handler;
    
     switch (mode) {
        case WBLE_SCAN_MODE_ACTIVE:
            m_scan_param.active = 1;
            break;
            
        case WBLE_SCAN_MODE_PASSIVE:
            m_scan_param.active = 0;
            break;
            
        default:
            return false;
    }
   
    m_scan_param.timeout = discovery_length;
    
    memset(m_found_devices_list, 0, sizeof(m_found_devices_list));
    m_num_devices = 0;
    
    scan_start();
    
    return true;
}

